# 1. Запросить у пользователя имя и вывести приветствие.
# 2. Запросить возраст и вывести, сколько лет будет пользователю через 10 лет.
# 3. Ввести два числа и вывести их сумму.
# 4. Ввести два числа и вывести сумму, разность, произведение и частное.
# 5. Ввести длину и ширину прямоугольника и найти его площадь.
# 6. Ввести радиус круга и вычислить площадь круга.
# 7. Ввести температуру в градусах Цельсия и перевести её в Фаренгейты.
# 8. Ввести количество секунд и перевести их в часы, минуты и секунды.
# 9. Поменять значения двух переменных местами.
# 10. Определить тип введённого значения после преобразования в int, float и str.



name = input("Как вас зовут: ")
print("Добро пожаловать,", name)


age = int(input("Сколько вам лет?"))
print("Через 10 лет вам будет", 10 + age, "лет" )

summ = int(input("Введите первое число: "))
summ2 = int(input("Введите второе чилсло: "))
print("Сумма двуч чисел:", summ + summ2)


summ3=int(input("Введите число: "))
summ4= int(input("Введите следующее число: "))
print("Сумма:",summ3 + summ4,
      "Разность: ", summ3 - summ4,
      "Произведение: ",summ3 * summ4,
      "Частное: ", summ3 / summ4)


shirina=int(input("Введите ширину: "))
dlins=int(input("Введите длину: "))
print("Площадь фигуры: ", shirina * dlins )


radius=int(input("Введите радиус круга: "))
print("Площадь круга: ", (radius * radius) * 3.14)


temp = int(input("Сколько градусов в Нукусе?: "))
print("В нукусе",  temp, "градусов целсий,", "а по шкале Фаренгейта", (temp * 9) / 5 + 32, "градусов")


second=int(input("Сколько секунд ты можешь продержаться в планке?: "))
print("В планке вы можете продержаться: ", second/60,"минут или же: ", second/3600, "часов")

a=input("Введите любое значение: ")
b=input("Также введите следующее значение: ")
print("Перевернутый вид:  ",b,a)


peremennaya=int(input("Введите значение: "))
print(type(peremennaya))


zur=int



